# PushTransform Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..PushTransform Method
ExporterIFC Class See Also
---
Sets the internal transform of the exporter to process the geometry and properties of the input element.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void PushTransform(
	Transform trf
)
```

Visual Basic
---
```text
Public Sub PushTransform ( _
	trf As Transform _
)
```

Visual C++
---
```text
public:
void PushTransform(
	Transform^ trf
)
```

# ### Parameters
trf
    Type: Autodesk.Revit.DB..::..Transform The transform.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace